{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"units": 8, "name": "dense_115", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "dtype": "float32", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 2], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"units": 32, "name": "dense_116", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 128, "name": "dense_117", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 256, "name": "dense_118", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 256, "name": "dense_119", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 128, "name": "dense_120", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 64, "name": "dense_121", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 16, "name": "dense_122", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 1, "name": "dense_123", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "trainable": true, "activation": "sigmoid", "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}], "keras_version": "2.2.2"}